; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.7.0
; Author:	jasonliull <jasonliull@gmail.com> ; efree <efreeking@gmail.com>
; Homepage:
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
1=文件
2=首选项
3=帮助
4=首先作为自解包程序检查(&X)
; ------------------------------------
5=选择文件
6=要提取的压缩包或安装程序(&A)：
7=选择文件夹
8=提取文件夹(&F)：
9=你可以在本标签页上拖放文件
; ------------------------------------
10=%s 选项
11=保留解包历史记录(&K)
12=隐藏控制台窗口(&H)
13=提供更新(&O)：
14=语言(&L)：
15=记忆窗口大小不做改动(&M)
16=提取之后请勿关闭窗口(&N)
; ------------------------------------
17=特殊格式选项
18=执行文件之前进行警告(&W)
19=移除重复文件(&R)
20=清除临时文件(&T)
21=添加丢失的文件扩展名(&P)
22=提取成功后删除该文件(&I)
; ------------------------------------
23=关于程序
; ------------------------------------
24=%s 网站
25=官方版本站点
26=增订版本论坛
; ------------------------------------
27=更新中
28=最近更新程序 %s 天前!
29=立即更新程序?
30=整合到右键菜单(&G)
; ------------------------------------
31=提取(&E)
32=保存(&S)
33=更新(&U)
34=取消(&C)
35=设置
; ------------------------------------
36=%s 提取
37=%s 支持使用以下方式来提取 %s 包。%n很抱歉，任何方式都不是 100% 可靠的。%n如果默认的方法不成功，请返回 %s 并选择另一种方式。
; ------------------------------------
38=提取方式
39=%s 管理式安装程序
40=%s 提取
41=%s 切换
42=%s 解包
43=不是一个 InstallShield 安装程序
44=解包之后显示提要(&Y)
; ------------------------------------
; GUI control functions
45=禁用程序声响(&D)
46=
47=文件不存在:%n%s%n请选择一个现存的文件。
48=打开文件
49=写入到
50=所有
; Common terms
51=档案
52=压缩文件
53=
54=电子书
55=电子贺卡
56=编码文件
57=未知可执行文件
58=初始化失败
59=帮助文件
60=热修补程序
61=图像
62=安装程序
63=合并模块
64=组件
65=补丁
66=自解包程序
67=阶段
68=初始化成功
69=测试中
70=提取中:
71=压缩包大小
72=更新
73=压缩包名称
74=每一周|每两周|每个月|从不
; Status messages
75=正扫描文件测定文件类型
76=正在使用 %s 扫描
77=正提取文件自：
78=正在等待安装程序初始化。%n请稍候
79=中断抽取点按键盘ESC%n最小化/恢复窗口点按键盘F11
; Custom prompts
80=%s CD-ROM 镜像无法被直接提取。 取代方式是此镜像%n将被转换为 ISO CD-ROM 镜像，这样即可被提取。%n%n你希望继续吗？%n注意：本过程将需要几分钟时间。
81=错误： CD-ROM 镜像无法被转换。
82=错误： 已经为 %s 镜像创建了 ISO 文件，但是它不能被转换。%n你希望保留 ISO 文件以便之后分析吗?
83=错误：看来这不是一个有效MHT文件。监测不到边界存在。
84=%s。 请退出安装程序，然后单击确定以继续。
85=注意： 此方法仅对某些 Wise for Windows 安装包有效。%n如果此 Wise 安装向导开始之后需要用户输入，此文件则不%n支持。请退出安装程序，且 %s 将放弃提取。%n%n你希望继续吗?
86=此文件被 %s 压缩。你可以继续提取不带 %s 解包或者仅仅执行 %s 解包。%n%n点击 '是' 提取不带 %s 解包。%n%n点击 '否' 仅仅运行 %s 解包。%n%n后一种情形，被解包的文件会被命名为：%n%s
87=错误：%s%n无法被解包。
88=警告：要提取此类文件，必须直接运行它。%n如果继续，以下命令将会运行：%n%n%s%n%n如果你认为此文件可能带有恶意代码，推荐你不要继续。%n你想要继续提取吗？
89=警告：目标文件夹 %s 已经存在！%n解压到非空文件夹可能导致解包错误。%n%n你要解包前清理该文件夹吗?
90=解包需要密码！%n%n取消选中 '%s'%n激活密码输入。
91=解包这个压缩文件需要额外安装解包器 %s
; Help text
92=提取文件自任何压缩文件类型或安装程序。%n运用：%n%s%n%n支持参数：%n%s%t%t显示此帮助信息%n%s%t%t打开的选项卡 %s%n%s%t要提取文件名称%n%s%t提取到文件夹%n%n通过 %s 而不是目标文件夹名称指示 %s 提取到档案名称命名的子文件夹。%n%n范例：%s%n%n运行 %s 不带任何参数将显示主窗口，用户可以指定文件名和目标文件夹。
93=抽取使用%s
; Error messages
94=%s 提取操作无法记录。
95=使用7-Zip压缩
96=%s 无法提取。%n返回的文件类型为： %s%n%n如果希望自己分析此文件，请单击确定，否则单击取消退出。
97=%s%n具有未知扩展名，无法被提取。
98=%s%n无法被创建。请选择一个可用的目标。
99=%s 无法被提取。%n它看起来是一个 %s，可被支持，但是提取失败。%n请查看日志文件 %s，要获得更多信息。%n%n单击确定立即查看日志文件，单击取消可退出。
100=
; Update messages
101=更新已完成
102=开始更新，请等待...
103=正下载文件
104=下载完成!
105=更新至版本： %s
106=%n重启中 %s!
107=你的当前版本为：%s%n不需要升级!
; ------------------------------------
108=载入失败
109=未能从服务器列表载入文件%n或许你无法连接到网络%n或更新服务不可用。
110=下载文件失败
111=解包文件出错
112=当升级到版本： %s%n时出错，重来!!!
113=已完成: %s 至 %s
114=
115=
116=
117=
118=
119=
